Autodesk.Revit.DB.BuiltInFailures.LinkFailures.WatchedLinkMoved
Monitored Link moved.

Autodesk.Revit.DB.BuiltInFailures.LinkFailures.SourceFileDrivenByOtherTarget
Linked Model's Shared Coordinates have been modified via another host model in this session. In order to be able to change the Linked File via the active host model, Save and open it again in a new session.

Autodesk.Revit.DB.BuiltInFailures.LinkFailures.NoConstraintsToLinks1
Constraints may not be created to linked instances using Shared Locations.  Constraints will be removed.

Autodesk.Revit.DB.BuiltInFailures.LinkFailures.MultipleLinks
Can't complete operation.  Linked Files have the same name.

Autodesk.Revit.DB.BuiltInFailures.LinkFailures.ModifyingLinkedFile
Shared Locations in the Linked Model '[Name]' have been modified, but not saved back to the Linked File.
Upon reopening, instances of the Linked Model will return to their last Saved Positions.
You can Save the Linked Model later via the Manage Links dialog.

Autodesk.Revit.DB.BuiltInFailures.LinkFailures.ModifiedLinkedFile
Shared Sites in the link have been modified, use move instance to reset the change.

Autodesk.Revit.DB.BuiltInFailures.LinkFailures.LinkedFileOpenInOtherDoc
Linked file cannot be reloaded because it is loaded into another open document.

Autodesk.Revit.DB.BuiltInFailures.LinkFailures.LinkInstanceNeedsReconcile
Instance of linked .rvt file needs Coordination Review

Autodesk.Revit.DB.BuiltInFailures.LinkFailures.DeleteLinkSymbolPrompt
All instances of Linked Model '[Name]' have been deleted, but the file itself is still loaded.
Remove the Linked File using Manage Links dialog to save memory unless you are going to reuse it in this project.
Removing the Link cannot be undone.

Autodesk.Revit.DB.BuiltInFailures.LinkFailures.DataDictionaryDifferentInLink
Linked file [Name] was last saved in a previous version of Revit.  Changes to it cannot be saved until it is upgraded.

Autodesk.Revit.DB.BuiltInFailures.LinkFailures.CannotUnlinkFile
Can't unlink file.

Autodesk.Revit.DB.BuiltInFailures.LinkFailures.CannotReloadFile
Can't reload file.

Autodesk.Revit.DB.BuiltInFailures.LinkFailures.CannotPublishSharedCoordinatesToMirroredNonRevitLinks
Shared coordinates cannot be published to mirrored, non Revit, links.

Autodesk.Revit.DB.BuiltInFailures.LinkFailures.CannotOpenLinkedFileServerNotFound
Cannot open the linked model using Open and Unload because the plugin [name] cannot be accessed. Please check
plugin [name], which has server Id [serverId]

Autodesk.Revit.DB.BuiltInFailures.LinkFailures.CannotOpenLinkedFileServerFound
Cannot open the linked model using Open and Unload because the plugin [name] provided by [vendor]
experienced an error.  For more information please contact [vendor].

Autodesk.Revit.DB.BuiltInFailures.LinkFailures.CannotModifyLinkedFile
Shared Sites in the link ""%1!s!"" cannot be modified.

Autodesk.Revit.DB.BuiltInFailures.LinkFailures
Failures about LinkFailures.